[{"Date": "10/14/2023", "Media": "Defense World", "Title": "Infosys Stock Forecast, Price & News (NYSE:INFY)", "Article": "Ad Behind the Markets\n\nBREAKING: Tiny biotech successfully treats blindness\n\nThere's a tiny biotech in Cambridge that's using a breakthrough technology to treat blindness. This company has already shown success in human trials... And Our research shows that anyone who gets in today could see a 46,751% return.\n\nGet the Details Here >>>", "Summary": "Ad Behind the MarketsBREAKING: Tiny biotech successfully treats blindnessThere's a tiny biotech in Cambridge that's using a breakthrough technology to treat blindness.\nThis company has already shown success in human trials... And Our research shows that anyone who gets in today could see a 46,751% return.\nGet the Details Here >>>"}, {"Date": "10/14/2023", "Media": "Defense World", "Title": "Infosys Stock Forecast, Price & News (NYSE:INFY)", "Article": "Ad Investing Daily 1,537 Recent Views\n\nHow He Maintained A Staggering 97% Trading Win Rate Over 6+ Years\n\nEconomic Downturns, Pandemics, Wars—Nothing Shakes His Portfolio. He's Had Unearthly Wins In Both Bull And Bear Markets. For Close To A Decade, He’s Maintained A Staggering 97% Trading Win Rate. He Didn't Follow The Wall Street Playbook, And Still Became A Millionaire Trader By The Age Of 37!\n\nWatch His Exclusive Tell-All Interview Here Now", "Summary": "Ad Investing Daily 1,537 Recent ViewsHow He Maintained A Staggering 97% Trading Win Rate Over 6+ YearsEconomic Downturns, Pandemics, Wars—Nothing Shakes His Portfolio.\nHe's Had Unearthly Wins In Both Bull And Bear Markets.\nFor Close To A Decade, He’s Maintained A Staggering 97% Trading Win Rate.\nHe Didn't Follow The Wall Street Playbook, And Still Became A Millionaire Trader By The Age Of 37!\nWatch His Exclusive Tell-All Interview Here Now"}, {"Date": "10/14/2023", "Media": "Defense World", "Title": "Infosys Stock Forecast, Price & News (NYSE:INFY)", "Article": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application management and application development services, independent validation solutions, product engineering and management, infrastructure management services, traditional enterprise application implementation, support, and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Panaya platform, Infosys Equinox, Infosys Helix, Infosys Applied AI, Infosys Cortex, and Stater digital platforms; and Infosys McCamish, an insurance platform. It serves enterprises in the financial services and insurance, manufacturing, retail, consumer packaged goods, logistics, energy, utilities, resources, services, communications, telecom OEM, media, hi-tech, and life sciences and healthcare industries. The company has a collaboration with Microsoft to accelerate and democratize industry-wide adoption of generative AI. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India.", "Summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally.\nIt provides application management and application development services, independent validation solutions, product engineering and management, infrastructure management services, traditional enterprise application implementation, support, and integration services.\nThe company's products and platforms include Finacle, a core banking solution; Edge suite of products; Panaya platform, Infosys Equinox, Infosys Helix, Infosys Applied AI, Infosys Cortex, and Stater digital platforms; and Infosys McCamish, an insurance platform.\nThe company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011.\nInfosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India."}, {"Date": "10/14/2023", "Media": "Defense World", "Title": "Infosys Stock Forecast, Price & News (NYSE:INFY)", "Article": "Ad Oxford Club\n\nBetter Than Oil Stocks\n\nThe best way to profit from energy is NOT a stock...Rather, it's this little-known alternative investment.\n\nCLICK HERE TO FIND OUT MORE", "Summary": "Ad Oxford ClubBetter Than Oil StocksThe best way to profit from energy is NOT a stock...Rather, it's this little-known alternative investment.\nCLICK HERE TO FIND OUT MORE"}, {"Date": "10/14/2023", "Media": "Business Today", "Title": "TCS, Infosys & HCL headcounts shrink by over 16,000 in Q2", "Article": "Leading IT services majors TCS, Infosys and HCLTech’s net employee addition has shrunk by more than 16,000 during the July-September quarter of the ongoing financial year amid continuing macroeconomic headwinds forcing a reduction in their growth forecasts for FY24.\n\nAccording to the results declared for the second quarter, the three companies together have an employee base of 1.15 million at the end of September 2023 compared to 1.17 million three months ago.\n\nIndia’s second largest IT services provider Infosys reported the sharpest decline in net employee base at 7,530 people during the quarter. Mumbai-headquartered TCS saw a reduction of 6,333 employees, while Noida-headquartered HCLTech reported a decrease of 2,299 employees.\n\nAll three IT giants also saw their voluntary attrition levels moderating to around 14 per cent—a contrast to the 20 per cent-plus attrition witnessed two years ago at the peak of the tech talent war. The opening up of plethora of tech opportunities in the wake of pandemic-led digitisation of organisations saw tech employees negotiating multiple job offers and exorbitant joining hikes. And tech organisations witnessed high offer dropout rates.\n\nNow, however, the scenario has changed considerably as the IT majors have cut revenue growth forecasts for the ongoing financial year. Infosys cut its revenue guidance for 2023-24 to 1-2.5 per cent compared to the 1-3.5 per cent given earlier. HCLTech has reduced revenue growth guidance for the full year in the range of 5-6 per cent from 6-8 per cent projected at the end of June 2023 quarter due to its below-expectation performance during the first half of the current fiscal.\n\nPointing to a significant fresher bench that is being trained on Gen AI, Infosys CFO Nilanjan Roy said the company is not looking to make fresh campus hires yet this year.\n\nHCL Tech CEO & MD C Vijaykumar said in the earnings call that the recruitment part has reduced because they hired many freshers. The Noida firm, which added 3,630 freshers during the quarter, said it plans to hire 10,000 freshers this year compared to around 27,000 freshers it recruited in 2022-23.\n\nOn the people front, TCS CEO N Krithivasan had said in an analyst call after Q2 result declaration: “We continue to have the right talent, but have recalibrated our gross hiring to ensure better utilisation of our existing capacity.” The firm’s CHRO Milind Lakkad pointed out that they invested in fresh talent for the past 18 months. “That investment is now paying off. And as a result, and also because of lower attrition, we kind of recalibrated our gross hiring and those numbers are less than our attrition. And hence, there's a net reduction.”\n\nAlso read: TCS, Infosys, HCL Tech: Should you buy, hold or sell these IT stocks?\n\nAlso read: TCS, Infosys, HCLTech: Hiring crashes across Indian IT companies in Q2 FY24", "Summary": "Mumbai-headquartered TCS saw a reduction of 6,333 employees, while Noida-headquartered HCLTech reported a decrease of 2,299 employees.\nThe opening up of plethora of tech opportunities in the wake of pandemic-led digitisation of organisations saw tech employees negotiating multiple job offers and exorbitant joining hikes.\nInfosys cut its revenue guidance for 2023-24 to 1-2.5 per cent compared to the 1-3.5 per cent given earlier.\nAnd hence, there's a net reduction.”Also read: TCS, Infosys, HCL Tech: Should you buy, hold or sell these IT stocks?\nAlso read: TCS, Infosys, HCLTech: Hiring crashes across Indian IT companies in Q2 FY24"}, {"Date": "10/13/2023", "Media": "Defense World", "Title": "Infosys Stock Forecast, Price & News (NYSE:INFY)", "Article": "Ad Investing Daily 1,537 Recent Views\n\nHow He Maintained A Staggering 97% Trading Win Rate Over 6+ Years\n\nEconomic Downturns, Pandemics, Wars—Nothing Shakes His Portfolio. He's Had Unearthly Wins In Both Bull And Bear Markets. For Close To A Decade, He’s Maintained A Staggering 97% Trading Win Rate. He Didn't Follow The Wall Street Playbook, And Still Became A Millionaire Trader By The Age Of 37!\n\nWatch His Exclusive Tell-All Interview Here Now", "Summary": "Ad Investing Daily 1,537 Recent ViewsHow He Maintained A Staggering 97% Trading Win Rate Over 6+ YearsEconomic Downturns, Pandemics, Wars—Nothing Shakes His Portfolio.\nHe's Had Unearthly Wins In Both Bull And Bear Markets.\nFor Close To A Decade, He’s Maintained A Staggering 97% Trading Win Rate.\nHe Didn't Follow The Wall Street Playbook, And Still Became A Millionaire Trader By The Age Of 37!\nWatch His Exclusive Tell-All Interview Here Now"}, {"Date": "10/13/2023", "Media": "Business Today", "Title": "TCS, Infosys, HCLTech: Hiring crashes across Indian IT companies in Q2 FY24", "Article": "Major Indian IT companies Tata Consultancy Services, Infosys, and HCLTech announced their Q2 FY24 results this week. A major trend observed across all these companies was a significant drop in headcount numbers.\n\nTCS\n\nThe IT company saw a net decline in headcount of 6,333 employees on a quarterly basis. TCS’s net employee headcount was at 608,985 as of September 30. The company’s employee headcount was at 615,318 in the June quarter.\n\nThe IT services company witnessed a drop in headcount on a yearly basis too. Their headcount in Q2FY23 was at 616,171. The headcount in Q2FY24 was down by 7,186 employees.\n\nMilind Lakkad, CHRO of the company, attributed this to the company's recalibration of its hiring targets.\n\n“Our strategy of proactively hiring bright freshers and investing in training them with the right skills is paying off. With that talent coming on stream and with reduced attrition, we were able to recalibrate our gross additions, keeping it below the departures during the quarter, driving up productivity and enhancing project outcomes,” Lakkad explained.\n\nInfosys\n\nInfosys reported a net fall of 7,530 employees in its headcount sequentially.\n\nInfosys has 3,28,764 employees on its roll as of September 2023, as per its quarterly results. The company had 3,36,294 employees in the previous quarter.\n\nThe headcount also dipped when compared to the year ago quarter. The headcount is down 16,454 YoY.\n\nInfosys has also slowed down on hiring, and will not conduct mass recruiting drives across Indian college campuses, CFO Nilanjan Roy noted during the post results press conference. He explained that the company has a significant bench size, because of which hiring plans have been put on the back-burner.\n\n“Company is not going to campuses as yet. Last year, we hired 50,000 freshers and hired ahead of demand, we still have a significant fresher bench,” Roy said.\n\nHCLTech\n\nIT company HCLTech’s net headcount addition also declined like its peers. The headcount dipped by 2,299 in Q2 FY 24. The company’s total headcount stood at 2,21,139. This is the second consecutive quarter of headcount decline at the IT major. The company’s headcount in Q1 had dropped by 2,506.\n\nCEO and MD C Vijayakumar explained that the headcount at the company went down since freshers on the bench or in training were ready to be put on projects.\n\nHe said, \"Our employee count decreased by 1 percent on a sequential basis because we consciously didn't backfill attrition as a lot of freshers we hired in the last 18 months are now ready to be deployed.\"\n\nSector overview\n\nThree major IT companies have released their results so far. Apart from financials, Q2 has been a tepid quarter when it comes to hiring as well. In the year ago quarter, TCS had hired 9,840; Infosys had hired 10,032; and HCLTech had hired 8,382 people. The combined headcount growth of these three companies stood at 28,254.\n\nWhereas, in the September 2023 ended quarter, the net employee addition of all the three companies combined is negative and is at 16,162.", "Summary": "Major Indian IT companies Tata Consultancy Services, Infosys, and HCLTech announced their Q2 FY24 results this week.\n“Our strategy of proactively hiring bright freshers and investing in training them with the right skills is paying off.\nLast year, we hired 50,000 freshers and hired ahead of demand, we still have a significant fresher bench,” Roy said.\nHCLTechIT company HCLTech’s net headcount addition also declined like its peers.\nIn the year ago quarter, TCS had hired 9,840; Infosys had hired 10,032; and HCLTech had hired 8,382 people."}, {"Date": "10/13/2023", "Media": "MarketScreener", "Title": "India's Infosys slides as revenue forecast cut on demand woes", "Article": "Infosys Limited is an information services company, their end-to-end business solutions include: - consulting and systems integration comprising consulting, enterprise solutions, systems integration and advanced technologies; - business IT services comprising application development and maintenance, independent validation services, infrastructure management, engineering services comprising product engineering and life cycle solutions and business process management; - products, business platforms and solutions to accelerate intellectual property led innovation, including Finacle TM, our banking product, which offers solutions to address core banking, mobile banking and e-banking needs of retail, corporate and universal banks worldwide; - newer areas such as cloud computing, enterprise mobility and sustainability. Net sales break down by market between finance (32%), retail and logistics (14.6%), telecommunications services (12.5%), energy and utilities (11.9%), manufacturing industry (11%), technology (8.2%), life sciences, health care and insurance (7%) and other (2.8%). Net sales are distributed geographically as follows: India (2.9%), North America (61.7%), Europe (24.8%) and other (10.6%).", "Summary": "Infosys Limited is an information services company, their end-to-end business solutions include: - consulting and systems integration comprising consulting, enterprise solutions, systems integration and advanced technologies; - business IT services comprising application development and maintenance, independent validation services, infrastructure management, engineering services comprising product engineering and life cycle solutions and business process management; - products, business platforms and solutions to accelerate intellectual property led innovation, including Finacle TM, our banking product, which offers solutions to address core banking, mobile banking and e-banking needs of retail, corporate and universal banks worldwide; - newer areas such as cloud computing, enterprise mobility and sustainability.\nNet sales break down by market between finance (32%), retail and logistics (14.6%), telecommunications services (12.5%), energy and utilities (11.9%), manufacturing industry (11%), technology (8.2%), life sciences, health care and insurance (7%) and other (2.8%).\nNet sales are distributed geographically as follows: India (2.9%), North America (61.7%), Europe (24.8%) and other (10.6%)."}, {"Date": "10/13/2023", "Media": "MarketScreener", "Title": "India's Infosys slides as revenue forecast cut on demand woes", "Article": "Infosys Limited is an information services company, their end-to-end business solutions include: - consulting and systems integration comprising consulting, enterprise solutions, systems integration and advanced technologies; - business IT services comprising application development and maintenance, independent validation services, infrastructure management, engineering services comprising product engineering and life cycle solutions and business process management; - products, business platforms and solutions to accelerate intellectual property led innovation, including Finacle TM, our banking product, which offers solutions to address core banking, mobile banking and e-banking needs of retail, corporate and universal banks worldwide; - newer areas such as cloud computing, enterprise mobility and sustainability. Net sales break down by market between finance (32%), retail and logistics (14.6%), telecommunications services (12.5%), energy and utilities (11.9%), manufacturing industry (11%), technology (8.2%), life sciences, health care and insurance (7%) and other (2.8%). Net sales are distributed geographically as follows: India (2.9%), North America (61.7%), Europe (24.8%) and other (10.6%).", "Summary": "Infosys Limited is an information services company, their end-to-end business solutions include: - consulting and systems integration comprising consulting, enterprise solutions, systems integration and advanced technologies; - business IT services comprising application development and maintenance, independent validation services, infrastructure management, engineering services comprising product engineering and life cycle solutions and business process management; - products, business platforms and solutions to accelerate intellectual property led innovation, including Finacle TM, our banking product, which offers solutions to address core banking, mobile banking and e-banking needs of retail, corporate and universal banks worldwide; - newer areas such as cloud computing, enterprise mobility and sustainability.\nNet sales break down by market between finance (32%), retail and logistics (14.6%), telecommunications services (12.5%), energy and utilities (11.9%), manufacturing industry (11%), technology (8.2%), life sciences, health care and insurance (7%) and other (2.8%).\nNet sales are distributed geographically as follows: India (2.9%), North America (61.7%), Europe (24.8%) and other (10.6%)."}, {"Date": "10/13/2023", "Media": "Business Today", "Title": "Infosys shares brace for selloff post FY24 guidance cut. Stock may underperform peers, say analysts", "Article": "A commentary on persistent demand slowdown was all expected from Indian IT players following Accenture's uninspiring FY24 guidance, but Infosys slashing its guidance, this time the upper end of the FY24 guidance, for the second straight quarter, was something the market was unprepared for. It completely overshadowed other positives from the Salil Parekh-led firm's earnings.\n\nIf an overnight 7 per cent fall in Infosys American depositary receipts (ADR) is any hint, Infosys shares are likely to see a steep fall as the market opens on Friday. This could be a similar fall that the stock witnessed post Q1 results.\n\nMotilal Oswal Securities insisted FY24 guidance cut was surprising but not material. It said Infosys' dollar revenues at $4.72 billion and CC sequential revenue growth at 2.3 per cent QoQ were ahead of its estimates. This was primarily due to a one-time pass-through revenue gain of 160 basis points.\n\nLarge deal total contract value (TCV) at $7.7 billion was the highest ever, as Infosys won four mega deals during the quarter. Besides, a 40 basis points margin improvement during the quarter was encouraging and indicated Infosys' ability to manage workforce, analysts said.\n\n\"However, despite the strong revenue beat and deal inflow, Infosys surprisingly lowered the upper end of its FY24 revenue growth guidance to 1.0-2.5 per cent YoY CC from 1-3.5 per cent YoY CC earlier, attributing it to continued weakness in discretionary spends and a delay in mega deal scale-up to FY25,\" Motilal Oswal said while suggesting a share price target of Rs 1,660 on the stock.\n\n\"A gap down opening in the Rs 1,400-1,420 range could be seen in the opening trade,” said Prashanth Tapse, Senior VP for Research at Mehta Equities.\n\nInfosys indicated volume compression in base business, cutting of discretionary spending and postponement of discretionary spends and late start dates on new projects won as reasons for guidance cut. Its management expects revenue decline in Q3 due to seasonality and Q4 to be driven by completion of a large deal. It, though, retained its margin guidance of 20–22 per cent.\n\nIf one includes TCS and HCL Technologies commentary, the expectation that the December quarter would be flat or show some mild growth sequentially has been belied, Nirmal Bang said adding that the results have likely led to consensus downgrading estimates.\n\n\"We have been negative on the stock and the sector for the last 18 months. We continue to be cautious even now as we believe the worst on the macro front is ahead of us and not behind us. We recently cut FY25 revenue/earnings for the entire sector as we believe our base case of a shallow US recession is pushed back into 2024,\" it said while suggesting a target of Rs 1,253 on the stock, valuing it at 10 per cent discount to TCS.\n\nSumit Pokharna, Research Analyst, Vice President at Kotak Securities said weak volumes have been fed into the guidance, which implies flat to 1.9 per cent decline in revenues in the next two quarters.\n\n\"The EBIT margin of 21.2 per cent was ahead of our estimate of 20.6 per cent despite higher pass-through revenues. While net headcount increased by 7.5K employees to 328.7K employee QoQ, the headcount decline on YoY comparison stands at 16.5K employees or 5 per cent. Employee utilisation of ex-trainees has increased, indicating that utilisation has scope to increase further,\" Pokharna said.\n\nDespite delivering better-than-expected results, Infosys trimmed its guidance, which is a reflection of it facing exceptionally higher ramp-downs than anticipated (higher than peers too), said Nuvama Institutional Equities.\n\n\"While the management alluded to strong deal-wins supporting FY25E growth, the weak exit rate of FY24 would mean FY25 growth is likely to be in mid-single digits. We continue to believe that Infosys is going through some company-specific issues (not to be seen as a read-across for the sector), exacerbated by weak macros. We, hence, expect Infosys to underperform peers in near-to-medium term,\" Nuvama said while suggesting a target of Rs 1,400 on the stock.", "Summary": "A commentary on persistent demand slowdown was all expected from Indian IT players following Accenture's uninspiring FY24 guidance, but Infosys slashing its guidance, this time the upper end of the FY24 guidance, for the second straight quarter, was something the market was unprepared for.\nMotilal Oswal Securities insisted FY24 guidance cut was surprising but not material.\nIt said Infosys' dollar revenues at $4.72 billion and CC sequential revenue growth at 2.3 per cent QoQ were ahead of its estimates.\nBesides, a 40 basis points margin improvement during the quarter was encouraging and indicated Infosys' ability to manage workforce, analysts said.\nWe, hence, expect Infosys to underperform peers in near-to-medium term,\" Nuvama said while suggesting a target of Rs 1,400 on the stock."}]