[{"Summary": "Generative artificial intelligence (GAI) requires substantial computational resources for model training and inference, but the electronic-waste (e-waste) implications of GAI and its management strategies remain underexplored.\nHere we introduce a computational power-driven material flow analysis framework to quantify and explore ways of managing the e-waste generated by GAI, with a particular focus on large language models.\nOur findings indicate that this e-waste stream could increase, potentially reaching a total accumulation of 1.2–5.0 million tons during 2020–2030, under different future GAI development settings.\nMeanwhile, we show that the implementation of circular economy strategies along the GAI value chain could reduce e-waste generation by 16–86%.\nThis underscores the importance of proactive e-waste management in the face of advancing GAI technologies."}, {"Summary": "While more than a half-dozen billionaire money managers are selling shares of Nvidia, Fisher Asset Management continues to build its stake in Wall Street's artificial intelligence (AI) darling.\nBut as required Form 13F filings with the Securities and Exchange Commission show, at least one billionaire asset manager has remained an avid buyer.\nBillionaire Ken Fisher has been adding to his fund's Nvidia stake for yearsNvidia's biggest billionaire supporter looks to be Ken Fisher of Fisher Asset Management.\nNvidia clocked in as Fisher Asset Management's third-largest holding by market value, as of the closing bell on June 30.\nWith Fisher Asset Management being a fairly active hedge fund, regular profit-taking is common."}, {"Summary": "Here is how to use the echo prompt as a means of improving the results you get out of generative AI.\ngettyIn today’s column, I showcase a clever and yet amazingly simple prompting technique that pays big dividends when using generative AI.\nGenerative AI Echo Prompting Comes To The ForeLet’s now shift into generative AI mode.\nExample Of Echo Prompting Via ChatGPTLet’s look at the echo prompt in action.\nEchoing The Use Of The Echo PromptI earlier mentioned that there were two ways to potentially do an echo prompt."}, {"Summary": "But the stocks stand out because the 12-month price targets set by Wall Street imply no downside.\nThat forecast implies 5% upside from its current share price of $162.\nAlphabet Alphabet is the largest digital advertising company and third-largest public cloud in the world.\nPatient investors should feel comfortable buying a small position in this AI stock today.\n2 Trillion-Dollar Artificial Intelligence (AI) Stocks to Buy Now, According to Wall Street was originally published by The Motley Fool"}, {"Summary": "Artificial intelligence will “revolutionize” the process by which drugs are discovered, chip giant Nvidia said this week, after unveiling a pilot project for Danish drugmaker Novo Nordisk to use its new AI-powered supercomputer.\n“Computer-aided drug discovery, I think that’s going to revolutionize the industry,” Nvidia CEO Jensen Huang said at a launch event for the computer, which researchers will use to train an AI model to facilitate vaccine design and analyze disease mutations, Bloomberg reported.\nADMachine learning has excited the pharma industry with its potential — for example, by scanning millions of possibilities to assess the effectiveness of shifting a drug to treat a different disease than first intended, replacing months of lab work.\nOne major breakthrough was Google DeepMind’s AlphaFold software, which predicts the structure and interactions of molecules — a previously complex, time-consuming process.\nIts inventors were awarded the Nobel Prize in Chemistry this month."}, {"Summary": "Connect with him on X (@gadget_ry) or Mastodon (@gadgetry@techhub.social)MIT researchers have developed a robot training method that reduces time and cost while improving adaptability to new tasks and environments.\nThis method marks a significant departure from traditional robot training, where engineers typically collect specific data for individual robots and tasks in controlled environments.\nThis improvement held true even when robots encountered tasks significantly different from their training data.\nLooking ahead, the team aims to enhance HPT’s capabilities to process unlabelled data, similar to advanced language models.\nTheir ultimate vision involves creating a universal robot brain that could be downloaded and used for any robot without additional training."}, {"Summary": "Share this:The artificial intelligence “revolution” that’s already reshaping business, culture and economies globally, comes with high electricity demands, creating myriad potential opportunities and pitfalls for Wyoming — an energy powerhouse.\nIs the unprecedented electricity demand an opportunity to extend the life of aging facilities that burn Wyoming coal?\nInstead, the panel agreed to continue to explore the large, complex nature of what artificial intelligence computations might have in store for the state.\n(Tennessee Watson/WyoFile)‘Enormous’ demandRegardless of where data centers are built in the western United States, Wyoming will likely be called upon to help feed the surging power demand.\nData centers, which essentially warehouse rows of computer servers, require a lot of electricity."}, {"Summary": "Amid rapidly growing demand, India’s energy sector faces two key challenges—providing affordable energy for domestic and industrial consumers and preparing the energy infrastructure for its expanding renewable energy (RE) base.\nPolicymakers can use AI to design policies that are impact driven while focusing on developing governance frameworks for the use of AI in energy systems.\nFor instance, these models can anticipate how incentives for renewable energy adoption may affect different sectors, optimizing for both impact and cost efficiency.\nSimultaneously, it is important to invest in training programs to skill and reskill the workforce in AI-driven energy systems.\nSimilar practices can be adopted for AI in energy systems and India can take a cue."}, {"Summary": "Energy is hot again now that big tech companies are planning to build massive new data centers to serve AI needs.\nBut most of the big winners so far are nuclear energy companies with no revenue and with years to go before they reach scale.\nAnd the numbers speak for themselves:Amazon: if you invested $1,000 when we doubled down in 2010, you’d have $21,217 !\nThe Motley Fool has positions in and recommends NextEra Energy.\nTravis Hoium is an affiliate of The Motley Fool and may be compensated for promoting its services."}, {"Summary": "The AI program detected heart murmurs in canines with 90% accuracy, similar to the accuracy of expert cardiologists, researchers report.\nPhoto by Jacqueline Garget/HealthDayArtificial intelligence can accurately detect heart murmurs in dogs, a new study finds.\nThe AI program detects heart murmurs in canines with 90% accuracy, similar to the accuracy of expert cardiologists, researchers report.\nThese heart murmurs are a key indicator of heart valve disease, the most common heart condition in adult dogs, researchers said.\nThe researchers fine-tuned the AI so it could detect and grade heart murmurs based on digital recordings, differentiating between murmurs caused by mild heart disease and those stemming from advanced disease."}]