[{"Summary": "In an extension of the anti-Muslim and anti-immigrant sentiments he channeled during his 2016 presidential run and made a cornerstone of his administration, Mr. Trump offered a litany of proposals that in many ways adapted his previous policies to reflect current events.\nHe promised again to bar people from certain parts of the world, particularly where Islam is most commonly practiced, while curbing immigration and the overall number of refugees the United States would take in.\n“We aren’t bringing in anyone from Gaza,” Mr. Trump said at a rally in Clive, Iowa, a suburb of Des Moines.\nReferring to recent demonstrations protesting Israel’s retaliatory bombardment of Gaza and supporting civilians in the region caught up in conflict, Mr. Trump promised to send Immigration and Customs Enforcement agents to what he called “pro-jihadist” rallies.\nHe also proposed that immigrants be denied entry to the United States if they adhered to a laundry list of ideologies."}, {"Summary": "Israel Ziv, a former general, reached a nearby battle in his Audi.\n“We are brought up to run as fast as possible toward the fire,” said General Goldfus.\nThe camera mounted on the Hamas commander’s head captured the moment he was shot and killed.\nBy the time the video stops, the commander can be seen slumped on the ground, revealing his long beard and thinning hairline.\nIn other parts of southern Israel, the first formal reinforcements came from an Israeli commando unit that arrived in helicopters, according to the senior Israeli officer."}, {"Summary": "Days after hundreds of Hamas terrorists from Gaza rampaged through border towns in a surprise assault that killed at least 1,400 Israelis, the region is bracing for further conflict.\nIn response to the shocking incursion, Israel has been pummeling the Gaza Strip with airstrikes, and the Palestinian Health Ministry has said that more than 2,800 Palestinians have been killed.\nIsrael has mobilized 360,000 reservists and troops are now massing at the border, leading to speculation that Israel will soon launch a ground offensive.\nIn a region with a long history of conflict, fighting along Israel’s northern border with Lebanon escalated.\nAnd Hezbollah, the Lebanese armed group, announced that it had targeted four separate Israeli locations."}, {"Summary": "In the days since Hamas attacked Israel, killing more than 1,200 people in sweeping assaults on kibbutzim, a music festival, towns and other places, violent images and graphic videos have flooded social media.\nSo too have false and misleading information, old and unrelated videos and photos with inaccurate claims, and fabricated assertions about the involvement of countries like the United States and Ukraine — adding confusion and deception to an already chaotic moment.\nThe false information circulating online risks clouding real evidence of atrocities that is emerging as Israeli soldiers retake control of places that were attacked: videos and photos, corroborated by witness accounts, that show that Palestinian gunmen attacked and killed Israeli civilians in large numbers.\nSoldiers and emergency workers are still recovering the dead, including children, in many communities."}, {"Summary": "Follow live news updates on the Israel-Hamas war.\nLast weekend’s attack on Israel by Hamas has brought renewed scrutiny of the armed Palestinian group’s longstanding relationship with Iran, and questions about whether the Gaza-based group could have pulled off such a sophisticated and devastating operation on its own.\nIran has a long history of training and arming proxy militia groups in the region, from Gaza to Lebanon, Iraq and Syria.\nAnd over the past year, there have been signs that Iran and its proxies were preparing to take a more aggressive approach toward Israel.\nGen. Esmail Ghaani, who is in charge of supervising Iran’s network of proxy militias as head of the country’s paramilitary Quds Force, repeatedly traveled to Lebanon for covert sessions with leaders of Hamas and Hezbollah, a Shiite Lebanese militia that Iran also supports."}, {"Summary": "The thousands of young Israelis had spent the night dancing at an outdoor rave, many clad in tie-dye T-shirts and crop tops.\nThe militants gunned down more than 100 ravers and abducted others, according to two senior Israeli officials, as they sprinted through the open fields.\nThose who survived often did so by hiding in nearby bushes, some of them for hours.\nBullets whistled overhead and shots resounded all around, said Andrey Peairie, 35, one of the survivors.\nHe described crawling up to the top of a nearby hill to get a better sense of what was happening."}, {"Summary": "Hamas is deterred, the briefers said, according to one of the security officials.\nIn calls monitored by Israeli intelligence agents, Hamas operatives who talked to one another also gave the sense that they sought to avoid another war with Israel so soon after a damaging two-week conflict in May 2021, according to two of the Israeli officials.\nIsraeli intelligence, they said, is now looking into whether those calls were real or staged.\nTwo of the officials said that the Israeli border surveillance system was almost entirely reliant on cameras, sensors and machine guns that are operated remotely.\nIsraeli commanders had grown overly confident in the system’s impregnability."}, {"Summary": "The strategy mirrors efforts by extremist groups like the Islamic State and Al Qaeda, which took advantage of the lack of guardrails at social media companies years ago to upload graphic footage to the internet.\nSocial media companies reacted then by removing and banning accounts tied to those groups.\nIsraeli groups who monitor social media for hate speech and disinformation said graphic imagery often starts on Telegram.\nIt then moves to X before finding its way to other social media sites.\n“Twitter, or X as they are now called, has become a war zone with no ethics,” said Achiya Schatz, director of FakeReporter, an Israeli organization that monitors disinformation and hate speech."}, {"Summary": "“Right now we do not have to say, ‘Yeah, but’ — ‘Sorry for the pain in Israel, but,’” she said.\n“We need some time to grieve, and that grief has a legitimacy and right to exist.\nAnd sometimes we’re so quick to go to the ‘but’ part that we negate that opportunity to grieve, which might be a place for coming together in grief.\n“That’s the main thing — loneliness,” the rabbi said, adding that students he had never spoken with before had approached him.\n“They say they walk through campus and they don’t know who thinks they deserve to be dead.”"}, {"Summary": "Residents of Israeli border towns told broadcasters that gunmen were moving door to door, looking for civilians.\nHamas leaders called for Arabs living in Israel and the West Bank to seize the momentum created by the assault and carry out their own attacks on Israelis.\nThree Palestinians died in clashes on Saturday with Israeli security forces in the West Bank, according to Palestinian officials.\nImage An Israeli soldier in Sderot standing by the bodies of people killed by Palestinian militants who entered from the Gaza Strip.\nAnd Gazans living close to the Israeli border fled to areas further inside the enclave, fearing an Israeli ground invasion."}]