[
{"ASIN": "B07TDP2MMQ", "Color": " White&Gray", "ProfileName": "Aimee Hoffman", "Stars": "5.0", "StarsText": "5.0 out of 5 stars", "Title": "5.0 out of 5 stars", "ReviewDate": "November 24, 2020", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "The media could not be loaded.\nI bought this because a coin op dryer ate my quarters... and I live in an apartment.\nIt cost me $1.00 to wash and $1.50 to dry for one load at my apartment complex. I do 2 loads of laundry every week. So $5 a week. $20 a month. $240 a year... I’d like to say that buying this machine saves me money immediately! And I don’t have to pay for water at my apartment complex.\nI waited about a month before leaving a review. It took about a week to receive after I placed my order. I also bought a 5 year warranty on it. So do that to save you the hassle if anything does happen to go wrong with the machine which can happen. It’s a machine, not a “ it will work till the end of time” miracle machine.\nLet’s gets one thing straight before I continue... THIS IS NOT A DRYER. This is a wash, drain and put your clothes in the spinner to get excess water out, then either hang dry or use a electric dryer. People complained how their clothes weren’t dry... it’s a PORTABLE WASHING MACHINE not a dryer even though most clothes come out to be barely wet. You will still need to either dry it by using a dryer or hang drying it.\nI bought a adjustable dolly to move the machine around on and 4 stainless steel hangers with clips both purchased on amazon posted in the photos above, to hang underwear, socks and wash rags.\nMy first load of laundry consisted of two scrub skirts, two scrub shirts, two tank tops, three pairs of shorts, six pairs of socks, and three pairs of underwear. All which fit fine in the machine just fine and I would have been able to add even more clothes into it.\nI do 2-15 minute wash cycles and 2-15 rinse cycles adding in fabric softener to the rinse and drain it into my toilet. The water just flows down and won’t clog your sinks or drains according to other reviews. I rinse by draining the wash water, adding clean water to it and adding in fabric softener. After it’s done rinsing, I drain it and put a couple items of clothing at a time in the spinner to drain excess water and they are pretty dry. Almost like a regular washer how damp your clothes are. But some clothes dried in like 10 minutes after hanging them. Don’t over load the spinner as it won’t work or drain properly.\nWhen you put an item of clothing into the spinner and it starts clunking around, rearrange the clothing just like you would when a normal washing machine that gets off balanced. I also don’t keep the plastic cover it comes in the spinner  as it makes too much noise. You could personally do without it. I don’t see the purpose in it.\nTowels can fit in the machine just fine but if you hang dry them, even with adding fabric softener, your towels will be hard and crunchy. Either deal with it, or put them in a dryer.\nYes, sometimes clothes will get tangled up. After the first 15 min cycle of washing, I lift the lid and untangle the articles of clothing if they are tangled and do the last 15 minute. Cycle. Not a big deal as that happens with regular washers as well.\nYou can either wait the full 5 minutes for spinning, or spin for about a minute till majority of the water is out and then either hang dry, or place in a dryer. But even after 1 minute most of the water is out of the clothing and it’s just damp at that point.\nThe directions it came with don’t even make sense.  So here’s what you do:\n1) On the backside of the machine you’ll find the plug in. Plug that into any outlet near the area you will be washing. Yes the cord could be longer. I would recommend a bathroom so you can put the drain hose into the toilet. See above photo\n2) attach the hose on the top of the machine to the sink you will be using to fill your machine up with. Again I recommend the bathroom sink. Photo above.\n3) make sure the switch on the top is on normal and not drain. If it’s on drain the water will “drain” and not fill up your machine. And if it’s on drain and your drain hose isn’t in the tub or another sink, or in the toilet, water will go everywhere. But I haven’t had this happen as I pay attention to what I’m doing.\n4) take the drain hose on the bottom left of the machine and put it under your toilet seat lid( after you have cleaned your toilet of course) so the water will drain into your toilet when you do drain it. Photo above. You can put it in the tub if you wish, but I couldn’t get the hose to stay put anywhere. Plus is gives my toilet an extra clean.\n5) fill 1/4-1/2 with clothes and add your soap. Liquid soap is better. Powder if you have to. No pods of any kind. What I like most is I can add as little or as much water as I want.\n6) fill water to the point all the clothes are covered with water. Don’t use too hot of water tho. Cold and Luke warm will do just fine.\n7) set time for 15 minutes twice and then drain( make sure drain hose isn’t on the floor and is either in the tub, another sink or the toilet). This is your wash cycle. You will have to go back after 15 minutes to set it for another 15 minutes for a total of 30 minutes washing. You could do a 15 minutes wash only if you wish.\n8) after you have drained the wash water, fill with clean water and fabric softener if you chose and do another 2-15 minute cycles to rinse. You will have to go back after 15 minutes to set it for another 15 minutes for a total of 30 minutes of rinsing. You could do only a 15 minutes rinse if you wish.\n9) drain the rinse water ( make sure drain hose isn’t on the floor and is either in the tub, another sink or the toilet) and keep the knob on drain. Remove the plastic top in the spinner side, it really has no purpose. Set the spinner to 5 minutes as thats all that allotted anyway. Add a couple of articles of clothing into the spinner. And close it. When it spins if you hear any knocking give it about 3 secs. If it stops your good. If it don’t, rearrange the clothes and try again until the knocking goes away.\n10) hang dry or use a electric dryer.\nYour clothes will be dry by morning if you do laundry in the evening. I hang mine in my bathroom or in my closet where they will be going anyway.\nI can’t understand why people complained about this machine... they are either abusing it by overloading it, misusing it or user error. A child could do their laundry with this thing.\nThis machine is so convenient as I don’t have to have to get ready and make myself presentable to go do laundry. I could do my laundry in my own apartment in my birthday suit. I love it. It’s small but does a lot of clothes at once. It’s compact and easy to maneuver around my apartment. It’s light weight, and easy to use.\nI will in the future be purchasing a dryer for my towels. Which is the only downside I have. But I’m not going to leave a bad review for that.\nBest purchase I have made in a long time."},
{"ASIN": "B07TDP2MMQ", "ProfileName": "Del Tyree", "Stars": "5.0", "StarsText": "5.0 out of 5 stars", "Title": "5.0 out of 5 stars", "ReviewDate": "September 5, 2023", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "2 years ago we bought this washer, It has saved us so much money. We live in a studio apartment and just simply cary it to our small bathroom and wash our laundry. We also have a compact drier so the savings at the laundry mat has paid for both items. We both work in the restaurant industry so we wash clothes daily. Can't wash blankets but it washes everything else even my white Adidas shoes. The spin dry is the most impressive part of the washer, it really is. The letters on the nobs have faded away but that's okay. Oh and it does leak a little puddle of water now that it's been heavy used, but just very little. And this washer must be attended to in between each and every cycle, if you walk away from it while it's filling with water it'll overflow. Luckily that's never happened to us, but we have had it drain on the ground and soaking the bathroom a few times. But that's our fault not the washers. The convenience factor of washing our clothes at home versus the laundromat is huge. If this washer were to break, I buy the same exact one. Oh and it's also a stylish washer"},
{"ASIN": "B07TDP2MMQ", "Color": " White&Gray", "ProfileName": "Amanda Lyn Toan", "Stars": "4.0", "StarsText": "4.0 out of 5 stars", "Title": "4.0 out of 5 stars", "ReviewDate": "November 16, 2020", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "So the main purpose I had in buying this was to avoid what I consider to be \"hassles\" of laundry in apartments (if you live in LA you know what I mean!). I hate getting coins (banks are hardly giving them out here anymore), I hate dragging the clothes back and forth to the laundry rooms, I hate having to go back and forth to make sure the clothes are still there (theft problems) or to see if someone moved them. I left one apartment with a W/D in the unit for a cheaper place and wanted to bring some of the convenience with me to the new apartment. This portable washer has helped great with that. It's small enough to fit in a corner or maybe a closet. But it's big enough to wash a decent amount of clothes. I was able to fit in several shirts, pants, personables and socks no problem. Several towels by themselves are just fine. The downside as others have mentioned is that you can't fit a large load of washing into the spinner part. It will fit about less than half of that so keep that in mind, you'll have to wait to do a few loads of spinning or just do smaller loads of washing to start. The noise level is good if you need to be mindful of neighbors and such. My original plan was to use the kitchen sink but the hose does not adapt well to average sink faucet. So now I will have to purchase an adapter. I watched a video on youtube for the minimal assembly it needed and for the initial instructions. Don't even bother with the manual that comes with it, it's written poorly and will do you no good. Another small downside is the spin cycle, depending on the amount of load, will shake a lot! I only do the spin cycle for a couple mins before hanging the clothes to dry, it doesn't really need the full 5 mins it allows, but depending on the load size and when you start the spin cycle at, it can violently shake the whole thing. My arms got a really good workout last night trying to hold it down, I felt like I was wrestling a bull. But, a couple of spin cycles it didn't do that at all, so my best guess is it varies by the size of the load. Next, watch the amount of detergent/water ratio. Less is more with these machines in my opinion. The good thing is you can use tide pods (though one whole pod is basically 2 loads with this machine), scent beads, etc.\nOthers have mentioned you cannot put heavy things like comforters and blankets and this is true but also not true. You can wash them in the wash loader, but not the spin loader, it's way too small and you risk having extremely wet and dripping blankets that you will have to transport somehow. So I recommend regular W/D units.\nThe machine is simple enough to use and it takes about the same amount of time to do a few loads of laundry as a normal Washer. Make sure you have a drying rack of some kind beforehand. Or plenty of spaces to hang clothes on hangers. The spin cycle does a good job but you have to hang them still. I used it for the first time in the bathroom because it was the only faucet that fit the hose that it came with and I drained the water into the toilet with no problems. I watched a video on how someone put a pair of panty hose over the drain hose so it would catch big pieces of dirt and I might try that especially since we have a dog and his hair goes EVERYWHERE. Also, I have wood floors and didn't need a roller to move the machine around (it did not mark up the wood floors at all) but if you have carpet you will definitely need something underneath to roll it. It's not too heavy to pick up but it will become a pain to move around like that every week. Overall for the price it costs at first versus the hundreds of dollars I will save from coin laundry, I would still recommend this machine."},
{"ASIN": "B07TDP2MMQ", "Color": " White&Gray", "ProfileName": "Cindy G", "Stars": "3.0", "StarsText": "3.0 out of 5 stars", "Title": "3.0 out of 5 stars", "ReviewDate": "January 20, 2020", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "UPDATE: 7 months into ownership I changed my review from 5 stars to 3. The lid on the spin dryer broke, which controls whether it turns on or not. I can rig it a bit myself when using it to get it to work properly, but I'd rather not do that of course. I contacted the company twice--once here on Amazon and once on their website--about trying to fix it and no response. If something breaks with this you are on your own. Like many products made in our joke of an economy, it's cheaply made, the company likely has a thin profit margin, and they will make no money unless they just stick you with it when something goes wrong.\nOLDER REVIEW:\nThis has so positively changed my life I don't know where to begin. In addition to easily washing your clothes, you can become an environmental hero and do almost all of your laundry using your own waste and grey water with this beautiful and glorious machine! People with fancy washer-dryers will be envious and inspired!\nFirst, this totally manages my household laundry needs for 1 and could easily take on more. I do towels, rugs, Queen sheets, and all my clothes with absolutely no problem. The spin dryer does an amazing job, in an average-humidity climate you will probably only need a few hours before they're totally dry. I simply put my clothes on hangers after spin drying them and put them directly in the closet to dry. No need for a clothesline or drying contraption and extra time and work in my opinion.\nI don't think anyone coming into my house who's looking at my textiles would have any idea I don't have a fancy washer and dryer. Your clothes are pretty much the same as if you had washed them in an expensive washer dryer. Maybe they are a little different and look a little more like hand washed and hang-dried clothes. But not much. They feel and smell amazing.\nIn order to fit this in my bathroom I had to reorganize my products and create a little system for housing all my laundry products too. In doing that, I have been able to completely reorganize my bathroom into a very functional space that is almost self cleaning.\nPlus, being able to maintain my laundry keeps my apartment so much cleaner. No more clothes that hang out clothing purgatory of the floor because they're not clean enough to hang but not dirty enough to haul to the laundromat. So, integrating this into my household has improved my life in major ways I had not planned on!\nSick of wasting water and feeling guilty about modern living when it comes to water usage? This machine is for you! Here are the ways I capture waste and grey water and use it to do laundry.\n1. You can collect water in the shower during the times when you aren't using products in there. You know, during those times when you just stand there and zone out and enjoy the wonderful hot shower? Well, put a 5 gallon bucket in there during those times and collect the clean water as you stand there, then dump it in the machine as the bucket fills. Use other opportunities during your shower to get clean water into the bucket and repeat.\n2. A lot of perfectly amazing clean water goes straight down the drain while waiting for cold tap water to get hot. No more! Hook up your little hose to the faucet and get that nice clean water into your bucket instead of down the drain. Then, dump that water into the washer.\nWith these two tricks, guess who already has water in the washer waiting for them when it's time to wash clothes?\n3. If you like to take baths, see if you can figure out how to just soak in the bath without using products--just for relaxation purposes. If you can do that, you will have an entire bathtub of water afterwards that you can use to do laundry. You could basically do at least one large load just with that. Just leave the water in the tub after you're finished, and go back and do laundry with it later!\nIf I am savvy enough with all of these little tricks, I swear I could probably get all of my laundry done without any increase in water usage. There's a lot of waste water in our daily lives and this is a great way to do something with it!!\nIf apartment dwellers did this on a big scale, a lot of water could be left in our rivers and lakes for the beautiful birds and fishies to enjoy and thrive in. You would have to do a study to see for sure. But just imagine, if all of us got out of the laundromats and used mostly our own waste and gray water to do laundry. I am pretty sure that is a lot of freshwater that we could leave in the beautiful outdoors.\nOkay, so stop living like a barbarian already and get this machine! I could not be happier now that I can do laundry right in my bathroom, and my wastewater is making all this magic happen. 🌠"},
{"ASIN": "B07TDP2MMQ", "ProfileName": "BeauMic", "Stars": "5.0", "StarsText": "5.0 out of 5 stars", "Title": "5.0 out of 5 stars", "ReviewDate": "April 23, 2021", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "The media could not be loaded.\nHowever, today, the Washer Timer Knob and agitator spin cycle stopped working properly. While I am able to turn the washer timer on, the agitator spin cycle now only goes in one direction, continuously, instead of alternating the spin both clockwise and counter-clockwise. And there is now a burning smell if I allow it to continue running with a one-way agitator spin.\nThis machine has been a lifesaver and I've been so satisfied. The product warranty ends at 90 days, IMO a more extended warranty should be offered, at least, for 1-2 years.\nIf someone from Kuppet (I've emailed you guys at KUPPETStore2018@hotmail.com) can advise me on how to fix this, I would be so grateful.\nI am not holding this against the company or product quality because I have been using this machine heavily since I purchased it.\nI'm also not opposed to purchasing this product, again, and have purchased another Kuppet product that I'm very happy with. I also am considering purchasing even more Kuppet products in the near future. I am just not in a position to re-purchase this product, right now.\nI would really appreciate it if someone could guide me on how to repair this issue, myself.\nThanks in advance.\n*Edit 4/29/2021:\nI have emailed both the 3rd party seller and the company directly via the email address provided on Kuppet.net. I have received no response from either.\nUnfortunately, I will be ordering another machine, because I did not plan on investing in a normal washing system, at the moment. But this time, I'm considering ordering it directly from Kuppet.net (it's actually listed for a cheaper price on their website). This brand is the only one that offers the large 18lbs washer barrel capacity.\nI notice other websites also list this item, such as Walmart - they do offer a 3-year warranty through Allstate Insurance. However, the 21lbs Capacity washing is being marketed as the 26lbs Capacity washer on that website. They aren't really selling the 26lbs Capacity washer, at least, not on their website.\nMaybe there are other websites that list this item and offer an extended warranty/insurance add-on.\nEdit 4/30/2021\nJust to get the machine assessed is going to be $90.  In describing my issue with a repair person with washing machine experience, the agitator motor needs to be replaced. The motor is manufactured in China by another company other than KUPPET and its parent company.\nWhat I did is reordered this product directly from KUPPET.net. I will keep the one I have, just in case, for parts. I'm not trying to get a regular washer/dryer, right now. And this has the largest washer capacity available on the market.\nCrossing fingers.\nBut this MARKET for compact portable washers is OPEN for lots of improvement. We need more models with large (26lbs +) capacity, more durable materials, and motors. We also need inexpensive parts available for purchase that customers can buy to fix their own unit or hire someone to do it without the worry of paying more for appliance repair servicing of the unit than what they paid for the unit.\nWe need companies with better customer service and who offer a robust FAQ about potential issues that may come up concerning their product available on their website.\nWe also need better manufacturer's warranty offers. If you know you build low-quality products, accommodate for this.\nUpdate 5/2/2021:\nI reordered directly from Kuppet. I  read a review indicating that there is 5 yr warranty plan offered. I looked and saw it listed under this item (that is currently out of stock). So, I was able to add the plan by itself to my cart and will try to apply it to my new machine.  I don't recall seeing an insurance plan offered when in initial purchase, however."},
{"ASIN": "B07TDP2MMQ", "ProfileName": "Misty D.", "Stars": "5.0", "StarsText": "5.0 out of 5 stars", "Title": "5.0 out of 5 stars", "ReviewDate": "February 15, 2021", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "This machine has been a godsend for apartment living. I don't feel the need to explain, as almost everyone is familiar with the down-sides of the laundromat experience.\nI have had the machine for a month now. I have had nothing but positive experience everytime I've used it. I do have some recommendations, though. I've read a LOT of the reviews and adjusted my use of the machine to prevent mechanical malfunctions. I'm not an engineer, just using common sense.\nFirst, the washer says it holds 18 pounds. A gallon of water is just a little over 8 pounds. I've not been able to find how many gallons the tub can hold, but I keep this in mind when I'm choosing what to put into the tub. Clothes weigh significantly more when they are wet. Also keeping in mind my size (Women's size 24) and dirtiness level, I'll normally only put two full outfits at one time. Doing the wash every other day hasn't been that much of an inconvenience for me. I will only put in one pair of jeans at a time, and I don't put the water higher than pulsator. I add water to the tub and then add a teaspoon of liquid soap. I will let it agitate a bit, turn it off, and add the clothes. I do it this way because of the placement of the agitator. It's on the bottom, and common sense tells me the less pressure it has on it while it spins keeps it working correctly in the long run.\nAfter the wash cycle, I will drain the tub. I let it drain into the toilet. I make sure to watch and listen. When the water has sufficiently drained, you can hear a difference in the pump in addition to seeing only a trickle of water coming out. That is when I turn the pump off.\nI then fill the tub again for the rinse. I make sure the clothes aren't sitting on the agitator, and turn it on again for the full 15 minutes. Drain again like I did previously.\nThe \"dryer\" has an 8 pound capacity. I'm careful not to over-load it. YOU DO NOT NEED TO TURN THE DRAIN KNOB. This is something the manufacturer doesn't address. You put the topper on, press down, and then set to anywhere between 1-5 minutes. Again, I watch the water draining and listen to the pump. Again, common sense tells me I don't need to let it spin for five minutes when the water stops flowing at 2 minutes.\nThe vast majority of the clothing will come out of the dryer slightly damp. Thicker fabrics, of course, will feel wetter than others.\nMy daughter is a size 10-12, and I will wash four of her outfits at once. We have queen and full size bedding. I will wash one bedding set at one time, and dry each item separately. Except for pillowcases.\nWe hang our clothing on hangers on the bathroom shower rod. They will be ready to wear the next morning.\nI have disovered a lot of lint on my clothes, and I plan on buying a lent catcher to add to the machine.\nOverall, I think if you add more water, less clothing, and just a teaspoon of washing detergent, you can use this machine with minimal damage. Is it a hassle to have to sit and watch/listen to it drain? Sure, but it's only five minutes.\nOverall, I've been very impressed with the machine, and figure that even with the smaller loads of laundry, I've saved $15 a week."},
{"ASIN": "B07TDP2MMQ", "ProfileName": "Virgil B.", "Stars": "4.0", "StarsText": "4.0 out of 5 stars", "Title": "4.0 out of 5 stars", "ReviewDate": "September 12, 2023", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "The ultimate I had with this unit was that it doesn't have an automatic rinse cycle"},
{"ASIN": "B07TDP2MMQ", "ProfileName": "Ginger Snapp", "Stars": "5.0", "StarsText": "5.0 out of 5 stars", "Title": "5.0 out of 5 stars", "ReviewDate": "July 30, 2021", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "As shown in the attached photo, it's tall but narrow. It's about 1/2 the width of my trash can. It's not very heavy at all. I store it in the corner of my kitchen, between my deep freeze & trash can. When I need to use it, I slide it across the kitchen very easily. I have extensive damage to my left arm/wrist/hand, but have no difficulty sliding this unit. I did try it in my bathtub when I 1st got it because that's why I didwith a smaller model I had previously. It honestly was too difficult to maneuver over the tub with my limited strength & mobility. But I'm very happy with it in my kitchen. A smaller model I had didn't pump out to drain, it only really used gravity. This model actually pumps out to drain, so I'm able to drain into the sink. The drain hose goes up & over the side of the sink & drains into it very well. That 1 feature made it feasible to use it in my kitchen & not have to struggle to get it into the bathtub. This wash fun is huge! You can see the clothes in front of unit in my photo, that is a load that I normally use. I honestly do a full size regular wash load in it. Except if I'm doing towels or jeans. Then I only do 3 or 4 at a time bc I don't want to break it. I've washed 3 queen sized sheets & 6 pillow cases in it at the same time. I hesitate to make very heavy loads though bc that's how I broke the last one lol the spin dryer side is also very large but about 1/3 the size of the wash tub. It works very well when used correctly - push the lid guard all the way down on to the clothes, but under the clothes. I use a hanging rack & hangers & fan to finish drying. Clothes are usually dry that night. The spinner gets lightweight clothes practically dry if used correctly. It does make noise but not like a big washer. I live in apartments & haven't had any complaints about noise. My box fan is actually louder lol\nFYI- I do usually put a towel down on the floor behind unit bc I usually have puddles. I'm not certain if that's bc I make such a splash mess or if the unit leaks slightly when draining.\nThe 1 complaint it that I wish the water inlet tube was a little thicker. I was able to stretch it to fit my faucet by using hot water to warm it up, slip it on the faucet, then switch to cold water to set the size firmly. That's great. The problem is when I use hot or warm water in the load, then the hose usually falls off & water just runs. So I've learned that when I use hot water, just stand there while it fills up - approx 8 minutes. Hot water also causes the lint filter cover to come of during wash. But again, that's just plastic getting too hot. To be fair, the instructions say not to use very hot water & I'm guessing this is why. For me, that's not a reason to not recommend this unit."},
{"ASIN": "B07TDP2MMQ", "Color": " White&Gray", "ProfileName": "Jj", "Stars": "5.0", "StarsText": "5.0 out of 5 stars", "Title": "5.0 out of 5 stars", "ReviewDate": "October 3, 2023", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "Sacar y desenredar la ropa es duro para personas con artritis ."},
{"ASIN": "B07TDP2MMQ", "Color": " White&Gray", "ProfileName": "Timothy R. Hanely", "Stars": "4.0", "StarsText": "4.0 out of 5 stars", "Title": "4.0 out of 5 stars", "ReviewDate": "July 3, 2020", "ReviewedAt": "the United States", "URL": "https://www.amazon.com/product-reviews/B07TDP2MMQ", "Review": "I've never written a product review before, so bare with me.  I'm single and live alone, so load size doesn't really matter.  My old machine expired and I have a move planned soon so I didn't want to have a huge appliance that I would have to move.  Sadly, the control board on my canyon sized dryer failed, so I am line drying my clothes until I buy a new dryer after I move.  I've done about 30 loads of laundry since I purchased it, so my review should be accurate.  I would have given it 5 stars if the hoses were a little more durable and the lint trap worked better.  The photo of the machine sitting on a toilet was to give you an idea of size and weight.\nPros:\n-Built in water jets circulate laundry very well.  Actually impressive.  There is no agitator pole, but it doesn't need one.  I added washing machine \"balls\" (I thought I would need them) and they work really well in agitating the clothing, but I didn't need them.  It's actually better than mom's HE washing machine that doesn't have an agitator or water jets to circulate the garments.\n-Very light - can be picked up and moved by almost anyone, and it easily fits into a guest closet for storage, or the backseat of a car if you need to move it.\n-Spinner is better than a full sized machine, clothing comes out nearly dry after spinning.\n-Can wash summer weight comforters, queen sized sheets, etc.  Fairly large capacity.  Clothing comes out cleaner than a full sized washer and you can see the dirt extracted from the clothing due to the white basin, and seeing the water as it drains.  Normal machines don't let you see how much dirt you've extracted.\n-Very economical on water consumption so you can wash garments twice if you're really picky or, wash and drain then rinse with clean water in the same basin.  This is better than trying to rinse in the spin basin.\n-Extremely convenient if you have a flat shower floor and a detachable shower head.\n-A load of laundry takes about 25 minutes from start to finish.\nCons:\n-Everything is manual (adding water, wash timer and drain settings) and the provided hoses are sub par.  Simply put, you have to fill the wash basin with water, then when finished washing switch to the drain setting manually.  Fortunately, I have a shower head that is attached to a hose, so I didn't need to use the provided fill and rinse hose and my shower is flat, so I drain the water directly onto the shower floor.\n-The spin basin only holds about half of what the wash basin holds, so you must spin a wash load several times.\n-The hoses provided are sub standard, but can be easily replaced if desired.\n-The directions are written in \"pigeon\" English (probably translated from Chinese).  It's only a few pages, but if you have a sense of humor, they're pretty funny.\n-If you close the lids after use, moldy odors develop.  I rinse out the machine after use, and let the basins air dry.\n-The lint trap basically doesn't work.  I have concerns about where threads from clothing are collecting.  I can't find them, YET.  This may become a problem at some point.  I don't know."}
]